# [중복 데이터 처리]
- 중복 데이터 기준 = 행
- 행단위로 모든  컬럼의 값 이 완전히 똑같은 데이터는 중복 데이터
- 처리 => 제거

In [1]:
import pandas as pd

In [2]:
file = "../DATA/employees.csv"

In [3]:
empDF = pd.read_csv(file)

In [4]:
empDF

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male     8/6/93       NaN   True     Marketing
1        Thomas    Male    3/31/96   61933.0   True           NaN
2         Maria  Female        NaN  130590.0  False       Finance
3         Jerry     NaN     3/4/05  138705.0   True       Finance
4         Larry    Male    1/24/98  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male    1/31/84   42392.0  False       Finance
997     Russell    Male    5/20/13   96914.0  False       Product
998       Larry    Male    4/20/13   60500.0  False  Business Dev
999      Albert    Male    5/15/12  129949.0   True         Sales
1000        NaN     NaN        NaN       NaN    NaN           NaN

[1001 rows x 6 columns]

데이터 전처리 => 중복 데이터 처리
- 중복 데이터 체크 => duplicated() : 중복이면 True
- 중복 데이터 처리 => drop_duplicate() : 삭제

In [7]:
# 중복 검사 
empDF.Team.duplicated() # 중복 중에서도 첫번째 값은 True임

0       False
1       False
2       False
3        True
4       False
        ...
996      True
997      True
998      True
999      True
1000     True
Name: Team, Length: 1001, dtype: bool